export default {
    // main section
    // html
    'Goroxels': 'Goroxels', // я не знаю, переводить название или нет, но на английском звучит красивше (Джон)
    'CHAT': 'ЧАТ',
    'login to chat': 'зарегистрируйтесь для чата',
    'template': 'шаблон',
    'template url': 'ссылка на картинку', // (шаблон) (Джон)
    'template opacity': 'непрозрачность шаблона',
    'settings': 'настройки',
    'game settings': 'общие настройки',
    'open window': 'настроить', // open window будет уместным перевести как настроить (открыть окно настройки) (Джон) 
    'account settings': 'настройки аккаунта',
    'change name': 'сменить ник',
    'logout': 'выйти',
    'toolbinds settings': 'горячие клавиши',
    'ui settings': 'настройки UI',
    'tools': 'инструменты',
    'online': 'онлайн',
    'Send alerts': 'Отправить алерты', // ? (Джон)
    // js and others
    // tools subsection
    'clicker': 'кликер',
    'protector': 'протектор',
    'alt protector': 'альтернативный протектор',
    'mover': 'двигалка', // ? (Джон)
    'floodfill': 'заливка',
    'pipette': 'пипетка',
    'alt pipette': 'альтернативная пипетка', // для второго цвета (Джон)
    'coords to chat': 'отправить координаты в чат',
    'pixel info': 'информация о пикселе',
    'swap colors': 'поменять цвета местами',
    'left color': 'цвет слева',
    'right color': 'цвет справа',
    'toggle chat': 'скрыть чат',
    'toggle menu': 'скрыть меню',
    'toggle everything': 'скрыть всё',
    'ctrlZ': 'ctrlZ',
    'grid': 'сетка',
    'paste': 'вставить',
    'template 0/N opaq': 'непрозрачность темплейта 0/N',
    'template 1/N opaq': 'непрозрачность темплейта 1/N', // где X - настраиваемое пользователем значение (Джон), а N - максимальное
    'square': 'квадрат', // имеется ввиду инструмент (Джон)
    '+brush size': 'увеличить размер кисти', 
    '-brush size': 'уменьшить размер кисти',
    'copy': 'копировать',
	
    // end tools subsection
    'colors size': 'размер цветов', // увеличивает квадраты цветов, находящихся в палитре -> увеличивает палитру (Джон)
    'palette width': 'размер палитры',
    'hide emojis': 'спрятать эмодзи',
    'emoji list': 'лист доступных эмодзи',
    'super secret button': 'кто нажмёт тот гей',
    'show placed pixels': 'показать счётчик пикселей',
    'show patterns over the palette': 'узоры поверх палитры',
    'more emojis!': 'навали эмодзи!',
    'show protected': 'показать защищённые пиксели',
    'brush size': 'размер кисти',
    'max saved pixels': 'максимум сохранённых пикселей',
    'disable chat colors': 'не показывать цвета в чате',
    'chat messages limit': 'лимит сообщений чата',
    'light grid': 'светлая сетка',
    'enable grid': 'включить сетку',
    'draw line length': 'отображать длину линии',
    'Case insensitive, 0/o i/l are same': 'Регистр не имеет значения, O/o и I/i одинаковы', // для капчи, если картинка имеет на себе HJKfY78, то значение hjkfy78 будет принято  (Джон)
    'Can\'t recognize?': 'Нечитаемо?',
    'Captcha': 'Капча',
    'search users': 'поиск пользователей',
    'OR': 'ИЛИ',
    'banned?': 'забанен?',
    'convert image into palette': 'сконвертировать картинку в палитру',
    'save canvas': 'скачать полотно',
	// rus intro translate (джон)
    'intro.introHeader': 'куда я попал',
    'how to play?': 'как играть?',
    'tools': 'инструменты',
    'intro.tools2header': 'андеграунд инструменты',
    'intro.desc': ' - это как <b>Pixel Battle</b>, только лучше!!',
    'intro.desc2': 'Крась поверх шаблона или рисуй отсебятину! Кд явно меньше секунды (ничего себе)!',
    'intro.desc3': 'Рисовать можно просто так. Но если зарегистрируешься, сможешь красить ещё быстрее (а ещё это секрет, но сможешь писать в чат, использовать заблокированные инструменты и бонус +5 к удаче)',
    'intro.howToPlayDecs': 'Выбираешь внизу цвет, кликаешь по полотну - там где кликнул, появится пиксель.<br>Самое то для консерватора. <br>НО. Почему бы не заглянуть всего одним глазком в следующую часть..?👁️',
    'intro.toolsDecs': 'Чтобы жить было легче, а трава зеленее, мы сделали кое-какую фигню:<br><i>P.S все клавиши можно переназначить в настройках</i>',
    'intro.toolsClicker': '<b>Кликер</b><br>ДА, он кликает. Нет, за тебя он рисовать не будет. Клавиша: Пробел<br>Доступен на мобиле: да',
    'intro.toolsAS': '<b>Туда-сюда</b><br>Быстро переключать цвета можно с помощью [A] и [S]',
    'intro.toolC': '<b>Пипетка</b><br>В игре есть пипетка [C]',
    'intro.brush': '<b>Кисть</b><br>Тем, кто хорошо себя вёл, доступен рисовальник побольше<br>Доступен на мобиле: да',
    'intro.line': '<b>Линия</b><br>Для ровных пацанов [Shift]',
    'intro.flood': '<b>Заливка</b><br>Да что ты мне заливаешь! [F]<br>Доступен на мобиле: да',
    'intro.resetColors': '<b>Сбросить выбранный цвет</b><br>можно лёгким движением руки [Правый клик]',
    'intro.grid': '<b>Сетка</b><br> включается на [G]',
    'intro.ctrlZ': '<b>Галя, атмена</b><br>Пиксели даже можно отменять!! Клавиша: [Z]<br>Лимит сохранения настраивается<br>Доступен на мобиле: да',
    'intro.tools2desc': 'Эти инструменты дополнительные, но от этого они только круче!!',
    'intro.toolsHiders': '<b>Убрать лишнее</b><br>с интерфейса можно отдельными кейбиндами. [K] скрывает чат, [L] скрывает верхнюю панель, а [;] скрывает всё сразу',
    'intro.multicol': '<b>Один серый, другой белый</b><br>Для продвинутых пользователей добавлена поддержка мультицвета - это когда кисть рисует сразу двумя цветами, чередуя их. <br>Нахрена?<br>Из-за дизеринга(когда картинка намеренно уродуется чтобы не смотреться ущербно в палитре сайта). <br>Часто картинка получается с чередующимися цветами, и чтобы не тратить последние нервные клетки - и была сделана эта штука; сиди, рисуй сразу двумя.',
    'intro.multicol2': 'Второй цвет можно выбрать [ПКМ] по цвету в палитре, либо с помощью брата пипетки - [Alt+C] на полотне.',
    'intro.multicol3': '(о нет.. Перепутал порядок цветов, а нервы на перделе? Просто нажми [X])',
	'intro.sendCoords': '<b>Координаты в чат</b><br>можно отправить, нажав [U]',
	'intro.templateTools': '<b>Шаблон</b><br>для шаблона тоже есть свои бинды! [O] и [P] моментально переключают его прозрачность.<br>А ещё перемещать шаблон можно зажав [Ctrl] и [ЛКМ]',
	'intro.templateIntro': 'Странник, ты зашёл так далеко! Что ж, я поделюсь секретом...',
	'intro.templateDesc': 'Принцип прост и, если это поможет, примерно такой же, как у pxls.space. <br>Ты вставляешь прямую ссылку на картинку в поле URL (сверху слева), вводишь нужные координаты и рисуешь поверх',
	'intro.templateDescConvert': '<b>Эм но вапщета моя картинка не в палитре</b><br>Если хочешь в палитре - иди на <a href="/convert" target="_blank">/convert</a>. Вставь картинку в поле ввода, которое сверху.',
	'intro.templateDescReminder': '<b>КСТАТИ</b><br>можно рисовать прямо как на этом видосе. Хочешь так же? Иди на <a href="/convert" target="_blank">/convert</a> (сконвертировать в узор -> [залить картинку на imgur])<br>'+
        '<i>P.S. Непрозрачность шаблона лучше поставь на максимум.</i><br>'+
        '<i>P.P.S. если ссылка красного цвета - придётся заливать вручную. Инструкция: </i><a href="//vk.cc/cmGiuG" target="_blank">vk.cc/cmGiuG</a>',
    'intro.authorHeader': 'автор',
    'intro.authorText':'Авторы - Горох со Товарищи',
    'intro.authorContacts': '<img src="./img/telegram.svg" style="vertical-align:middle;height:40px">&nbsp;<a href="//t.me/antieden">Telegram</a><br>'+
    '<img src="./img/discord-logo-circle.svg" style="vertical-align:middle;height:40px">&nbsp;Goroh#0385<br>'+
    '<img src="./img/discord-logo-circle.svg" style="vertical-align:middle;height:40px">&nbsp;<a href="//discord.gg/FeBMmwRUpA">Сервер игры</a>',
    // nsfw modal
    'WARNING': 'ВНИМАНИЕ',
    'This canvas may contain illustrations, inappropriate for people under age of 18, including:': 'Это полотно может содержать изображения, неприемлемые для лиц младше 18 лет, включая, но не ограничиваясь:',
    'Gore, furry, porn, hate, anime and all possible variations of these.': 'Насилие, фурри, порно, ненависть, аниме и всевозможные их комбинации.',
    'Are you 18 y.o. and fully understanding what are you doing?': 'Тебе есть 18 и ты полностью понимаешь что делаешь?',
    'I am 18 years old and I take responsibility for my psyche on myself': 'Мне есть 18 и я беру ответственность за свою психику на себя',	
    // converter section
    // html
    'Convert!': 'Конверт!',
    'Into palette': 'В палитру',
    'GO!': 'За Родину!',
    'Dithering': 'Дизеринг',
    'None': 'Нет дизеринга',
    'Floyd-Steinberg': 'Флойд-Штеинберг',
    'Stuсki': 'Штуки',
    'Chess': 'Шахматы',
    'Ordered (matrix)': 'Матричный',
    'Threshold': 'Порог',
    'Matrix size': 'Размер матрицы',
    'Darken': 'Темнее',
    'Lighten': 'Светлее',
    'Balance': 'Баланс',
    'Color function for ΔE': 'Дополнительные цветовые настройки',
    'RGB + luminance [very fast and dirty]': 'RGB + освещение [оч. быстро, "грязная" картинка]',
    'ciede2000 [slow and accurate]': 'ciede2000 [медленно, но верно]',
    'CMC I:c [weird and slow]': 'CMC I:c [всрато и медленно(но иногда лучше других)]',
    'Euclidian + color values [fast and dirty]': 'Евклид + значения восприятия [быстро, "грязная" картинка]',
    'brightness tune': 'регулировка яркости',
    'reset': 'сброс',
    'constrast tune': 'регулировка контраста',
    'resize preview automatically': 'автоматически увеличивать картинку',
    'serpentine (slightly suppresses dithering artefacts)': 'змейка (немного подавляет артефакты дизеринга)',
    'Into patterns': 'Конвертация в узоры',
    'Choose a palette': 'Выбрать палитру',
	
    // js and others
    'Image is loaded, but pixels can not be gotten. Try to load it on Imgur or download->upload from file': 'Картинка загружена, но пиксели не получены. Попробуй залить картинку на imgur или загрузить из файла',
    '[clipboard]': '[буфер обмена]',
    'Choose a image!': 'Выбери изображение!',
    'Invalid link!': 'Неверная ссылка!',
    'Done in': 'Сделал за', //: Done in TIME ms
    'ms.': 'мс.', // milliseconds
    's.': 'с.', // seconds
    'Unknown image loading error. Maybe CORS, so try to upload on Imgur': 'При загрузке произошла неизвестная ошибка. Возможно CORS шалит, так что попробуй загрузить на imgur.',
    'If your image is big, go make a tea and watch Doctor Who': 'Если твоя картинка слишком большая, наберись терпения. Завари чай и посмотри пару-тройку серий "Доктора Кто".', // или серии "Костей" про маньяков, рекомендую Пеланта и Кукольника (Джон)
    'Final image size:': 'Конечный размер картинки:',
    'Upload on imgur!': 'Загрузить на imgur!',
    'copy_canvas_btn': 'в буфер обмена',
    'download_canvas_btn': 'скачать',
    'Imgur upload failed, try upload manually': 'Попытка загрузки на imgur провалена. Попробуй загрузить вручную и скопируй ссылку самостоятельно', 
    'insert_link_here': 'вставь сюда ссылку',
    'imgur_album_link': 'Это не та ссылка! Скопируй правой кнопкой по картинке - "копировать ссылку на изображение", либо по кнопке "Copy link"',
    'Failed to load game palettes!': 'Не удалось загрузить палитры игры!',
    'URL/file/clipboard': 'URL/файл/буфер обмена',

    // admin section
    // html
    'Backup Viewer': 'Просмотр бэкапов',  // бэкапы (Джон) 
    'SELECT CANVAS': 'ВЫБЕРИ ПОЛОТНО',
    'SELECT DAY': 'ВЫБЕРИ ДЕНЬ',
    'SELECT TIME': 'ВЫБЕРИ ВРЕМЯ',
    'rollback': 'откат', 
    'Show chunk grid': 'Показать сетку чанков',
    'Crop chunks from': 'Показать только чанки с',  // ? (Джон)
    'to': 'по',
    'Crop rollback too': 'Также обрезать бэкап',
    'IP Actions': 'Действия с IP',
    'Blacklist': 'В чёрный список',
    'UnBlackist': 'Убрать из чёрного', // ? (Джон)
	'Whitelist': 'В белый список',
    'UnWhitelist': 'Убрать из белого',
    'send': 'отправить', // а что - уже совсем другая история (Джон)
    'set captchaEnabled state': 'включить капчу',
    'set': 'сделать', // задать, установить (Джон)
    'set afterJoinDelay value': 'изменить afterJoinDelay',  // как ты и просил (Джон)
    'Canvas Actions': 'Действия с полотном',
    'Canvas': 'Холст',
    'DO': 'СДЕЛАЙ', 
    'wipe': 'вайп',
    'enlarge': 'расширение', // применяется в значении контекста для увеличения холста, как и последующие строки? (Джон)
    'top': 'сверху',
    'right': 'справа',
    'bottom': 'снизу',
    'left': 'слева', 
    // js and others TODO
    'LOG IN': 'ВОЙТИ'
}